{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_data", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv0_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv0", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(7,7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(3,3)", 
        "stride": "(2,2)", 
        "workspace": "512"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn0", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(1,1)", 
        "pool_type": "max", 
        "stride": "(2,2)"
      }, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_conv1", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit1_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_conv2", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit1_bn3", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit1_relu3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_conv3", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_sc_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_sc", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[20, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[38, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit2_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit2_conv1", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit2_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit2_conv2", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit2_bn3", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0], [59, 0, 0], [60, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit2_relu3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit2_conv3", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[65, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit3_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0], [69, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit3_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit3_conv1", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit3_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit3_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit3_conv2", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[80, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit3_bn3", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[82, 0, 0], [83, 0, 0], [84, 0, 0], [85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit3_relu3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit3_conv3", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[90, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[91, 0, 0], [92, 0, 0], [93, 0, 0], [94, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_conv1", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit1_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[99, 0, 0], [100, 0, 0], [101, 0, 0], [102, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_conv2", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(2,2)", 
        "workspace": "512"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit1_bn3", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[107, 0, 0], [108, 0, 0], [109, 0, 0], [110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit1_relu3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_conv3", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[113, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_sc_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_sc", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(2,2)", 
        "workspace": "512"
      }, 
      "inputs": [[97, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[115, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit2_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[118, 0, 0], [119, 0, 0], [120, 0, 0], [121, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit2_conv1", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit2_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[126, 0, 0], [127, 0, 0], [128, 0, 0], [129, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit2_conv2", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[132, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit2_bn3", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[134, 0, 0], [135, 0, 0], [136, 0, 0], [137, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit2_relu3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit2_conv3", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[140, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[142, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit3_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[143, 0, 0], [144, 0, 0], [145, 0, 0], [146, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit3_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit3_conv1", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[149, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit3_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[151, 0, 0], [152, 0, 0], [153, 0, 0], [154, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit3_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit3_conv2", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[157, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit3_bn3", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[159, 0, 0], [160, 0, 0], [161, 0, 0], [162, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit3_relu3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit3_conv3", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[165, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[167, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit4_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[168, 0, 0], [169, 0, 0], [170, 0, 0], [171, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit4_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit4_conv1", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[174, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit4_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[176, 0, 0], [177, 0, 0], [178, 0, 0], [179, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit4_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit4_conv2", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[182, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit4_bn3", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[184, 0, 0], [185, 0, 0], [186, 0, 0], [187, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit4_relu3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit4_conv3", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[190, 0, 0], [191, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[192, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[193, 0, 0], [194, 0, 0], [195, 0, 0], [196, 0, 0], [197, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_conv1", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[199, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit1_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[201, 0, 0], [202, 0, 0], [203, 0, 0], [204, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_conv2", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(2,2)", 
        "workspace": "512"
      }, 
      "inputs": [[207, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn3_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn3_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit1_bn3", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[209, 0, 0], [210, 0, 0], [211, 0, 0], [212, 0, 0], [213, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit1_relu3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[214, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_conv3", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "1024", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[215, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_sc_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_sc", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "1024", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(2,2)", 
        "workspace": "512"
      }, 
      "inputs": [[199, 0, 0], [218, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[217, 0, 0], [219, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit2_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[220, 0, 0], [221, 0, 0], [222, 0, 0], [223, 0, 0], [224, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[225, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit2_conv1", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[226, 0, 0], [227, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit2_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[228, 0, 0], [229, 0, 0], [230, 0, 0], [231, 0, 0], [232, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[233, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit2_conv2", 
      "attrs": {
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
